Revit 2026 API

# SkylightFailures Properties

---

The BuiltInFailuresSkylightFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MinSkylightWidthImperial | The minimum skylight width is 8 inches. |
|  | MinSkylightWidthMetric | The minimum skylight width is 203.2 millimeters. |

#### Reference

BuiltInFailuresSkylightFailures Class

Autodesk.Revit.DB Namespace